wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_can.h
/**
*********************************************************************************************************
*               Copyright(c) 2024, Realtek Semiconductor Corporation. All rights reserved.
*********************************************************************************************************
* \file     rtl_can.h
* \brief    The header file of the peripheral CAN driver.
* \details  This file provides all CAN firmware functions.
* \author   colin
* \date     2024-06-26
* \version  v1.0
* *******************************************************************************************************
*/

/*============================================================================*
 *               Define to prevent recursive inclusion
 *============================================================================*/
#ifndef _RTL_CAN_H_
#define _RTL_CAN_H_

#ifdef __cplusplus
extern "C" {
#endif

/*============================================================================*
 *                        Header Files
 *============================================================================*/
#include "rtl876x.h"
#include "rtl_can_def.h"

/** @addtogroup 87x3eultra_CAN CAN
  * @brief Can driver module
  * @{
  */

/*============================================================================*
 *                          Private Macros
 *============================================================================*/
#define CAN_MESSAGE_BUFFER_MAX_CNT      16
#define CAN_MESSAGE_BUFFER_MAX_INDEX    (CAN_MESSAGE_BUFFER_MAX_CNT - 1)
#define CAN_MESSAGE_BUFFER_DEFAULT_LEN  20
#define CAN_MESSAGE_FIFO_START_ID       12
#define CAN_DEFAULT_ERR_WARN_TH         96
#define CAN_STAND_DATA_MAX_LEN          8
#define CAN_FD_DATA_MAX_LEN             64
#define CAN_STD_FRAME_ID_POS            18
#define CAN_EXT_FRAME_ID_POS            0
#define CAN_RAM_ACC_DATA_POS            11
#define CAN_STAND_FRAME_ID_MAX_VALUE    0x7FFUL
#define CAN_EXTEND_FRAME_ID_MAX_VALUE   0x3FFFFUL
#define CAN_FRAME_ID_MASK_MAX_VALUE     0x1FFFFFFFUL

/*============================================================================*
 *                         Constants
 *============================================================================*/
/** \defgroup 87x3eultra_CAN_Exported_Constants CAN Exported Constants
  * \brief
  * \{
  */

/**
 * \defgroup    CAN_DLC_BYTE CAN Data Length Byte
 * \{
 * \ingroup     87x3eultra_CAN_Exported_Constants
 */
#define CAN_DLC_BYTES_0                 (0x0UL)     //!< Data length = 0 byte.
#define CAN_DLC_BYTES_1                 (0x1UL)     //!< Data length = 1 byte.
#define CAN_DLC_BYTES_2                 (0x2UL)     //!< Data length = 2 bytes.
#define CAN_DLC_BYTES_3                 (0x3UL)     //!< Data length = 3 bytes.
#define CAN_DLC_BYTES_4                 (0x4UL)     //!< Data length = 4 bytes.
#define CAN_DLC_BYTES_5                 (0x5UL)     //!< Data length = 5 bytes.
#define CAN_DLC_BYTES_6                 (0x6UL)     //!< Data length = 6 bytes.
#define CAN_DLC_BYTES_7                 (0x7UL)     //!< Data length = 7 bytes.
#define CAN_DLC_BYTES_8                 (0x8UL)     //!< Data length = 8 bytes.
#define CAN_DLC_BYTES_12                (0x9UL)     //!< Data length = 12 bytes.
#define CAN_DLC_BYTES_16                (0xAUL)     //!< Data length = 16 bytes.
#define CAN_DLC_BYTES_20                (0xBUL)     //!< Data length = 20 bytes.
#define CAN_DLC_BYTES_24                (0xCUL)     //!< Data length = 24 bytes.
#define CAN_DLC_BYTES_32                (0xDUL)     //!< Data length = 32 bytes.
#define CAN_DLC_BYTES_48                (0xEUL)     //!< Data length = 48 bytes.
#define CAN_DLC_BYTES_64                (0xFUL)     //!< Data length = 64 bytes.

/** End of CAN_DLC_BYTE
  * \}
  */

/**
 * \defgroup    CAN_Interrupt_Definition CAN Interrupt Definition
 * \{
 * \ingroup     87x3eultra_CAN_Exported_Constants
 */
#define CAN_RAM_MOVE_DONE_INT                       BIT5    //!< Triggered when data move from register to CAN IP internal RAM finished.
#define CAN_BUS_OFF_INT                             BIT4    //!< Triggered when the bus is off.
#define CAN_WAKE_UP_INT                             BIT3    //!< Triggered when CAN awakened from low power mode.
#define CAN_ERROR_INT                               BIT2    //!< Triggered by an error during transmission.
#define CAN_RX_INT                                  BIT1    //!< Triggered when data is received.
#define CAN_TX_INT                                  BIT0    //!< Triggered when sending is completed.
/** End of CAN_Interrupt_Definition
  * \}
  */
#define IS_CAN_INT_CONFIG(CONFIG)     (((CONFIG) == CAN_RAM_MOVE_DONE_INT)  || \
                                       ((CONFIG) == CAN_BUS_OFF_INT)        || \
                                       ((CONFIG) == CAN_WAKE_UP_INT)        || \
                                       ((CONFIG) == CAN_ERROR_INT)          || \
                                       ((CONFIG) == CAN_RX_INT)             || \
                                       ((CONFIG) == CAN_TX_INT))
/**
 * \defgroup    CAN_Interrupt_Flag CAN Interrupt Flag
 * \{
 * \ingroup     87x3eultra_CAN_Exported_Constants
 */
#define CAN_RAM_MOVE_DONE_INT_FLAG                  BIT5    //!< Triggered when data move from register to CAN IP internal RAM finished.
#define CAN_BUS_OFF_INT_FLAG                        BIT4    //!< Triggered when the bus is off.
#define CAN_WAKE_UP_INT_FLAG                        BIT3    //!< Triggered when CAN awakened from low power mode.
#define CAN_ERROR_INT_FLAG                          BIT2    //!< Triggered by an error during transmission.
#define CAN_RX_INT_FLAG                             BIT1    //!< Triggered when data is received.
#define CAN_TX_INT_FLAG                             BIT0    //!< Triggered when sending is completed.

/** End of CAN_Interrupt_Flag
  * \}
  */
#define IS_CAN_INT_FLAG(FLAG)         (((CONFIG) == CAN_RAM_MOVE_DONE_INT_FLAG) || \
                                       ((CONFIG) == CAN_BUS_OFF_INT_FLAG)       || \
                                       ((CONFIG) == CAN_WAKE_UP_INT_FLAG)       || \
                                       ((CONFIG) == CAN_ERROR_INT_FLAG)         || \
                                       ((CONFIG) == CAN_RX_INT_FLAG)            || \
                                       ((CONFIG) == CAN_TX_INT_FLAG))
/**
 * \defgroup    CAN_ERROR_Mask CAN ERROR
 * \{
 * \ingroup     87x3eultra_CAN_Exported_Constants
 */
#define CAN_ERROR_RX                                BIT9    //!< Receiving error occurred.
#define CAN_ERROR_TX                                BIT8    //!< Sending error occurred.
#define CAN_ERROR_ACK                               BIT5    //!< Ack error occurred.
#define CAN_ERROR_STUFF                             BIT4    //!< Stuff error occurred.
#define CAN_ERROR_CRC                               BIT3    //!< CRC error occurred.
#define CAN_ERROR_FORM                              BIT2    //!< Form error occurred.
#define CAN_ERROR_BIT1                              BIT1    //!< BIT1 error occurred.
#define CAN_ERROR_BIT0                              BIT0    //!< BIT0 error occurred.

/** End of CAN_ERROR_Mask
  * \}
  */

#define IS_CAN_ERROR_STATUS(STATUS)   (((STATUS) == CAN_ERROR_RX)   || \
                                       ((STATUS) == CAN_ERROR_TX)   || \
                                       ((STATUS) == CAN_ERROR_ACK)  || \
                                       ((STATUS) == CAN_ERROR_CRC)  || \
                                       ((STATUS) == CAN_ERROR_FORM) || \
                                       ((STATUS) == CAN_ERROR_BIT1) || \
                                       ((STATUS) == CAN_ERROR_BIT0))

