wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_can.h
/** End of 87x3eultra_CAN_Exported_Constants
  * \}
  */

/*============================================================================*
 *                         Types
 *============================================================================*/
/** \defgroup 87x3eultra_CAN_Exported_Types CAN Exported Types
  * \brief
  * \{
  */

/**
 * \brief       CAN init structure definition.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef struct
{
    uint8_t CAN_FdEn;                       /*!< Specifies Whether the CAN FD function is enable. */
    uint8_t CAN_AutoReTxEn;                 /*!< Specifies Whether the auto re-transmission function is enable. */
    uint8_t CAN_RxFifoEn;                   /*!< Specifies Whether the rx fifo function is enable. */
    uint8_t CAN_RxDmaEn;                    /*!< Specifies Whether the rx dma function is enable. */
    uint8_t CAN_FdSspAutoEn;                /*!< Specifies Whether the automatic calculate ssp delay function is enable. */
    uint8_t CAN_TriSampleEn;                /*!< Specifies Whether the triple sample mode function is enable. */
    uint8_t CAN_FdCrcMode;                  /*!< Specifies the crc mode of CAN FD.
                                                        This parameter can be a value of @ref CANFdCrcModeSel_TypeDef */
    uint8_t CAN_TestModeSel;                /*!< Specifies the test mode of CAN.
                                                        This parameter can be a value of @ref CANTestModeSel_TypeDef */
    uint16_t CAN_ErrorWarnThd;              /*!< Specifies error counter warning threshold. */
    CAN_0x0C_TYPE_TypeDef CAN_BitTiming;    /*!< Specifies the bit timing of CAN. */
    CAN_0x10_TYPE_TypeDef CAN_FdBitTiming;  /*!< Specifies the bit timing of CAN FD. */
    CAN_0x14_TYPE_TypeDef CAN_FdSspCal;     /*!< Specifies the ssp of CAN FD. */
    CAN_0x40_TYPE_TypeDef CAN_TimeStamp;    /*!< Specifies the timestamp function of CAN. */
} CAN_InitTypeDef;

/**
 * \brief       CAN crc mode definition.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_FD_ISO_CRC,             //!< ISO crc.
    CAN_FD_NON_ISO_CRC,         //!< non-ISO crc.
} CANFdCrcModeSel_TypeDef;

/**
 * \brief       The state of CAN.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_BUS_STATE_OFF,          //!< CAN state on.
    CAN_BUS_STATE_ON,           //!< CAN state off.
} CANBusStateSel_TypeDef;

/**
 * \brief       The state of CAN RAM.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_RAM_STATE_IDLE,         //!< CAN RAM is idle.
    CAN_RAM_STATE_EXCHANGING,   //!< CAN RAM is exchanging.
} CANRamStateSel_TypeDef;

/**
 * \brief       The test mode of CAN.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_TEST_MODE_SILENCE,          //!< Silence mode.
#if CAN_SUPPORT_EXT_LOOPBACK
    CAN_TEST_MODE_EXT_LOOPBACK,     //!< External loopback mode.
#endif
    CAN_TEST_MODE_INT_LOOPBACK,     //!< Internal loopback mode.
    CAN_TEST_MODE_NONE,             //!< No test mode.
} CANTestModeSel_TypeDef;

/**
 * \brief       The data type of CAN frame.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_RTR_DATA_FRAME = 0,         //!< Data frame.
    CAN_RTR_REMOTE_FRAME = 1,       //!< Remote frame.
} CANRtrSel_TypeDef;

/**
 * \brief       The type of CAN ID.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_IDE_STANDARD_FORMAT = 0,    //!< Standard ID.
    CAN_IDE_EXTEND_FORMAT = 1,      //!< Extend ID.
} CANIdeSel_TypeDef;

/**
 * \brief       The type of CAN frame ID.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_EDL_STARDARD_FRAME = 0,     //!< Standard frame.
    CAN_EDL_FD_FRAME = 1,           //!< FD frame.
} CANEdlSel_TypeDef;

/**
 * \brief       The bit timing of CAN FD.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_BRS_NO_SWITCH_BIT_TIMING = 0,   //!< No switch bit timing.
    CAN_BRS_SWITCH_BIT_TIMING = 1,      //!< Switch bit timing.
} CANBrsSel_TypeDef;

/**
 * \brief       The type of CAN frame.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_INVALID_DATA_FRAME,             //!< Invalide data frame.
    CAN_STD_DATA_FRAME,                 //!< Standard data frame.
    CAN_EXT_DATA_FRAME,                 //!< Extend data frame.
    CAN_STD_REMOTE_FRAME,               //!< Standard remote frame.
    CAN_EXT_REMOTE_FRAME,               //!< Extend remote frame.
    CAN_FD_STD_DATA_FRAME,              //!< FD standard data frame.
    CAN_FD_EXT_DATA_FRAME,              //!< FD extend data frame.
} CANDataFrameSel_TypeDef;

/**
 * \brief       The error of CAN.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef enum
{
    CAN_NO_ERR = 0,                     //!< No error.
    CAN_MSG_ID_ERR = 1,                 //!< Can message id error.
    CAN_ID_ERR = 2,                     //!< Can frame id error.
    CAN_DATA_LEN_ERR = 3,               //!< Can frame data length error.
    CAN_TYPE_ERR = 4,                   //!< Can frame type error.
    CAN_RAM_STATE_ERR = 5,              //!< Can frame ram status error.
    CAN_TIMEOUT_ERR = 6,                //!< Can timeout error.
} CANError_TypeDef;

/**
 * \brief       The members of CAN frame.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef struct
{
    uint8_t msg_buf_id;                 //!< Message buffer ID.
    uint8_t frame_brs_bit;              //!< The brs bit of frame.
    uint8_t auto_reply_bit;             //!< The auto reply bit of frame.
    CANDataFrameSel_TypeDef frame_type; //!< The type of frame.
    uint16_t standard_frame_id;         //!< The standard frame ID.
    uint32_t extend_frame_id;           //!< The extend frame ID.
} CANTxFrame_TypeDef;

/**
 * \brief       The members of CAN RX frame.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef struct
{
    uint8_t msg_buf_id;                         //!< Message buffer ID.
    uint8_t rx_dma_en;                          //!< The dma enable bit of RX frame.
    CANFrameRTRMask_TypeDef
    frame_rtr_mask;     //!< Can frame RTR mask, 0 means don't care, 1 means the bit should match.
    CANFrameIDEMask_TypeDef
    frame_ide_mask;     //!< Can frame IDE mask, 0 means don't care, 1 means the bit should match.
    uint32_t frame_id_mask;                     //!< Can frame ID mask, 0 means the ID bit in CAN_RAM_ARB don't care, 1 means the bit should match.
    uint8_t frame_rtr_bit;                      //!< Can frame RTR bit, determine DATA or REMOTE frame.
    uint8_t frame_ide_bit;                      //!< Can frame IDE bit, determine standard or extend format.
    uint8_t auto_reply_bit;                     //!< The auto reply bit of RX frame.
    uint16_t standard_frame_id;                 //!< Standard frame ID.
    uint32_t extend_frame_id;                   //!< Extend frame ID.
} CANRxFrame_TypeDef;

/**
 * \brief       The members of message buffer.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef struct
{
    uint8_t rtr_mask;                   //!< The mask of rtr.
    uint8_t ide_mask;                   //!< The mask of ide.
    uint8_t id_mask;                    //!< The mask of id.
    uint8_t esi_bit;                    //!< The mask of esi.
    uint8_t auto_reply_bit;             //!< The auto reply bit.
    uint8_t rxtx_bit;                   //!< The rxtx bit.
    uint8_t rx_lost_bit;                //!< The rx lost bit.
    uint8_t data_length;                //!< The data length.
    uint8_t rx_dma_en;                  //!< The dma enable bit.
    CANBrsSel_TypeDef brs_bit;          //!< The brs bit \ref CANBrsSel_TypeDef.
    CANEdlSel_TypeDef edl_bit;          //!< The edl bit \ref CANEdlSel_TypeDef.
    CANRtrSel_TypeDef rtr_bit;          //!< The rtr bit \ref CANRtrSel_TypeDef.
    CANIdeSel_TypeDef ide_bit;          //!< The ide bit \ref CANIdeSel_TypeDef.
    uint16_t rx_timestamp;              //!< The time stamp.
    uint16_t standard_frame_id;         //!< Standard frame ID.
    uint32_t extend_frame_id;           //!< Extend frame ID.
} CANMsgBufInfo_TypeDef;

/**
 * \brief       The status of CAN fifo.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef struct
{
    uint8_t fifo_msg_lvl;               //!< Indicates the number of message in fifo.
    uint8_t fifo_msg_overflow;          //!< Indicates whether the fifo is overflow.
    uint8_t fifo_msg_empty;             //!< Indicates whether the fifo is empty.
    uint8_t fifo_msg_full;              //!< Indicates whether the fifo is full.
} CANFifoStatus_TypeDef;

/**
 * \brief       The members of RX dma data.
 *
 * \ingroup     87x3eultra_CAN_Exported_Types
 */
typedef struct
{
    CAN_0x340_TYPE_TypeDef can_ram_arb;         //!< ARB
    CAN_0x348_TYPE_TypeDef can_ram_cs;          //!< CS
    uint8_t rx_dma_data[CAN_FD_DATA_MAX_LEN];   //!< Data
} CANRxDmaData_TypeDef;

/** End of 87x3eultra_CAN_Exported_Types
  * \}
  */

