wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_can.h
/*============================================================================*
 *                         Functions
 *============================================================================*/
/** \defgroup 87x3eultra_CAN_Exported_Functions CAN Exported Functions
  * \brief
  * \{
  */

/**
 * \brief   Deinitializes the CAN peripheral registers to their default values.
 * \param[in] CANx: selected CAN peripheral.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void can_driver_init(void)
 * {
 *     CAN_DeInit(CAN0);
 * }
 * \endcode
 */
void CAN_DeInit(CAN_TypeDef *CANx);
/**
 * \brief   Initializes the CAN peripheral according to the specified
 *          parameters in the CAN_InitStruct
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] CAN_InitStruct: Pointer to a CAN_InitTypeDef structure that
 *            contains the configuration information for the specified CAN peripheral
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void can_driver_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_CAN0, APBPeriph_CAN0_CLOCK, ENABLE);
 *
 *     CAN_InitTypeDef init_struct;
 *
 *     CAN_StructInit(&init_struct);
 *     init_struct.CAN_AutoReTxEn = DISABLE;
 *     init_struct.CAN_BitTiming.can_brp = 7;
 *     init_struct.CAN_BitTiming.can_sjw = 3;
 *     init_struct.CAN_BitTiming.can_tseg1 = 4;
 *     init_struct.CAN_BitTiming.can_tseg2 = 3;
 *
 *     init_struct.CAN_FdEn = ENABLE;
 *     init_struct.CAN_FdSspAutoEn = ENABLE;
 *     init_struct.CAN_FdBitTiming.can_fd_brp = 4;
 *     init_struct.CAN_FdBitTiming.can_fd_sjw = 3;
 *     init_struct.CAN_FdBitTiming.can_fd_tseg1 = 4;
 *     init_struct.CAN_FdBitTiming.can_fd_tseg2 = 4;
 *     init_struct.CAN_FdSspCal.can_fd_ssp_dco = 0;
 *     init_struct.CAN_FdSspCal.can_fd_ssp_min = 0;
 *     init_struct.CAN_FdSspCal.can_fd_ssp = 0;
 *
 *     CAN_Init(CAN0, &init_struct);
 *     CAN_Cmd(CAN0, ENABLE);
 * }
 * \endcode
 */
void CAN_Init(CAN_TypeDef *CANx, CAN_InitTypeDef *CAN_InitStruct);
/**
 * \brief   Fills each CAN_InitStruct member with its default value.
 * \param[in] CAN_InitStruct: Pointer to an CAN_InitTypeDef structure which will be initialized.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void can_driver_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_CAN, APBPeriph_CAN_CLOCK, ENABLE);
 *
 *     CAN_InitTypeDef init_struct;
 *
 *     CAN_StructInit(&init_struct);
 *     init_struct.CAN_AutoReTxEn = DISABLE;
 *     init_struct.CAN_BitTiming.can_brp = 7;
 *     init_struct.CAN_BitTiming.can_sjw = 3;
 *     init_struct.CAN_BitTiming.can_tseg1 = 4;
 *     init_struct.CAN_BitTiming.can_tseg2 = 3;
 *
 *     init_struct.CAN_FdEn = ENABLE;
 *     init_struct.CAN_FdSspAutoEn = ENABLE;
 *     init_struct.CAN_FdBitTiming.can_fd_brp = 4;
 *     init_struct.CAN_FdBitTiming.can_fd_sjw = 3;
 *     init_struct.CAN_FdBitTiming.can_fd_tseg1 = 4;
 *     init_struct.CAN_FdBitTiming.can_fd_tseg2 = 4;
 *     init_struct.CAN_FdSspCal.can_fd_ssp_dco = 0;
 *     init_struct.CAN_FdSspCal.can_fd_ssp_min = 0;
 *     init_struct.CAN_FdSspCal.can_fd_ssp = 0;
 *
 *     CAN_Init(CAN0, &init_struct);
 *     CAN_Cmd(CAN0, ENABLE);
 * }
 * \endcode
 */
void CAN_StructInit(CAN_InitTypeDef *CAN_InitStruct);
/**
 * \brief   Enable or disable the selected CAN mode.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] NewState: New state of the operation mode.
 *      This parameter can be: ENABLE or DISABLE.
 * \return  None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void can_driver_init(void)
 * {
 *     RCC_PeriphClockCmd(APBPeriph_CAN0, APBPeriph_CAN0_CLOCK, ENABLE);
 *
 *     CAN_InitTypeDef init_struct;
 *
 *     CAN_StructInit(&init_struct);
 *     init_struct.CAN_AutoReTxEn = DISABLE;
 *     init_struct.CAN_BitTiming.can_brp = 7;
 *     init_struct.CAN_BitTiming.can_sjw = 3;
 *     init_struct.CAN_BitTiming.can_tseg1 = 4;
 *     init_struct.CAN_BitTiming.can_tseg2 = 3;
 *
 *     init_struct.CAN_FdEn = ENABLE;
 *     init_struct.CAN_FdBitTiming.can_fd_brp = 4;
 *     init_struct.CAN_FdBitTiming.can_fd_sjw = 3;
 *     init_struct.CAN_FdBitTiming.can_fd_tseg1 = 4;
 *     init_struct.CAN_FdBitTiming.can_fd_tseg2 = 4;
 *     init_struct.CAN_FdSspCal.can_fd_ssp_dco = 0;
 *     init_struct.CAN_FdSspCal.can_fd_ssp_min = 0;
 *     init_struct.CAN_FdSspCal.can_fd_ssp = 0;
 *
 *     CAN_Init(CAN0, &init_struct);
 *     CAN_Cmd(CAN0, ENABLE);
 * }
 * \endcode
 */
void CAN_Cmd(CAN_TypeDef *CANx, FunctionalState NewState);
/**
 * \brief   Enable or disable the specified CAN interrupt source.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] CAN_INT: Specifies the CAN interrupt source to be enable or disable.
 *      This parameter can be the following values:
 *      \arg CAN_RAM_MOVE_DONE_INT: This bit is set to 1 when data move from register to CAN IP internal RAM finished.
 *      \arg CAN_BUS_OFF_INT: This bit is set to 1 when the state of bus is off.
 *      \arg CAN_WAKE_UP_INT: This bit is set to 1 when CAN awakened from low power mode.
 *      \arg CAN_ERROR_INT: This bit is set to 1 when there is an error during transmission.
 *      \arg CAN_RX_INT: This bit is set to 1 when data is received.
 *      \arg CAN_TX_INT: This bit is set to 1 when sending is completed.
 * \param[in]  NewState: New state of the specified CAN interrupt.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void can_driver_init(void)
 * {
 *     CAN_INTConfig(CAN0, (CAN_RAM_MOVE_DONE_INT | CAN_BUS_OFF_INT | CAN_WAKE_UP_INT |
 *                      CAN_ERROR_INT | CAN_RX_INT | CAN_TX_INT), ENABLE);
 * }
 * \endcode
 */
void CAN_INTConfig(CAN_TypeDef *CANx, uint32_t CAN_INT, FunctionalState newState);
#if (CAN_SUPPORT_INT_MSK_STS == 1)
/**
 * \brief   Mask or unmask the specified CAN interrupt source.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] CAN_INT: Specifies the CAN interrupt source to be enable or disable.
 *      This parameter can be the following values:
 *      \arg CAN_RAM_MOVE_DONE_INT: This bit is set to 1 when data move from register to CAN IP internal RAM finished.
 *      \arg CAN_BUS_OFF_INT: This bit is set to 1 when the state of bus is off.
 *      \arg CAN_WAKE_UP_INT: This bit is set to 1 when CAN awakened from low power mode.
 *      \arg CAN_ERROR_INT: This bit is set to 1 when there is an error during transmission.
 *      \arg CAN_RX_INT: This bit is set to 1 when data is received.
 *      \arg CAN_TX_INT: This bit is set to 1 when sending is completed.
 * \param[in]  NewState: New state of the specified CAN interrupt.
 *      This parameter can be: ENABLE or DISABLE.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void can_driver_init(void)
 * {
 *     CAN_MaskINTConfig(CAN0, (CAN_RAM_MOVE_DONE_INT | CAN_BUS_OFF_INT | CAN_WAKE_UP_INT |
 *                      CAN_ERROR_INT | CAN_RX_INT | CAN_TX_INT), ENABLE);
 * }
 * \endcode
 */

