wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_can.h
void CAN_MaskINTConfig(CAN_TypeDef *CANx, uint32_t CAN_INT_FLAG, FunctionalState NewState);
#endif
/**
 * \brief   Get the specified CAN interrupt raw status.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] CAN_INT: the specified CAN interrupt.
 *     This parameter can be one of the following values:
 *     \arg CAN_RAM_MOVE_DONE_INT_FLAG: This bit is set to 1 when data move from register to CAN IP internal RAM finished.
 *     \arg CAN_BUS_OFF_INT_FLAG: This bit is set to 1 when the state of bus is off.
 *     \arg CAN_WAKE_UP_INT_FLAG: This bit is set to 1 when CAN awakened from low power mode.
 *     \arg CAN_ERROR_INT_FLAG: This bit is set to 1 when there is an error during transmission.
 *     \arg CAN_RX_INT_FLAG: This bit is set to 1 when data is received.
 *     \arg CAN_TX_INT_FLAG: This bit is set to 1 when sending is completed.
 * \return The new state of CAN_INT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void CAN_Handler(void)
 * {
 *     if (SET == CAN_GetINTRawStatus(CAN0, CAN_RAM_MOVE_DONE_INT_FLAG))
 *  {
 *      DBG_DIRECT("[CAN] CAN_Handler CAN_RAM_MOVE_DONE_INT_FLAG");
 *      CAN_ClearINTPendingBit(CAN0, CAN_RAM_MOVE_DONE_INT_FLAG);
 *  }
 * }
 * \endcode
 */
ITStatus CAN_GetINTRawStatus(CAN_TypeDef *CANx, uint32_t CAN_INT_FLAG);
/**
 * \brief   Get the specified CAN interrupt status.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] CAN_INT: the specified CAN interrupt.
 *     This parameter can be one of the following values:
 *     \arg CAN_RAM_MOVE_DONE_INT_FLAG: This bit is set to 1 when data move from register to CAN IP internal RAM finished.
 *     \arg CAN_BUS_OFF_INT_FLAG: This bit is set to 1 when the state of bus is off.
 *     \arg CAN_WAKE_UP_INT_FLAG: This bit is set to 1 when CAN awakened from low power mode.
 *     \arg CAN_ERROR_INT_FLAG: This bit is set to 1 when there is an error during transmission.
 *     \arg CAN_RX_INT_FLAG: This bit is set to 1 when data is received.
 *     \arg CAN_TX_INT_FLAG: This bit is set to 1 when sending is completed.
 * \return The new state of CAN_INT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void CAN_Handler(void)
 * {
 *     if (SET == CAN_GetINTStatus(CAN0, CAN_RAM_MOVE_DONE_INT_FLAG))
 *  {
 *      DBG_DIRECT("[CAN] CAN_Handler CAN_RAM_MOVE_DONE_INT_FLAG");
 *      CAN_ClearINTPendingBit(CAN0, CAN_RAM_MOVE_DONE_INT_FLAG);
 *  }
 * }
 * \endcode
 */
ITStatus CAN_GetINTStatus(CAN_TypeDef *CANx, uint32_t CAN_INT_FLAG);
/**
 * \brief  Clear the CAN interrupt pending bit.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] CAN_INT_FLAG: Specifies the interrupt pending bit to clear.
 *     This parameter can be any combination of the following values:
 *     \arg CAN_RAM_MOVE_DONE_INT_FLAG: This bit is set to 1 when data move from register to CAN IP internal RAM finished.
 *     \arg CAN_BUS_OFF_INT_FLAG: This bit is set to 1 when the state of bus is off.
 *     \arg CAN_WAKE_UP_INT_FLAG: This bit is set to 1 when CAN awakened from low power mode.
 *     \arg CAN_ERROR_INT_FLAG: This bit is set to 1 when there is an error during transmission.
 *     \arg CAN_RX_INT_FLAG: This bit is set to 1 when data is received.
 *     \arg CAN_TX_INT_FLAG: This bit is set to 1 when sending is completed.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void CAN_Handler(void)
 * {
 *     if (SET == CAN_GetINTStatus(CAN0, CAN_RAM_MOVE_DONE_INT_FLAG))
 *     {
 *      DBG_DIRECT("[CAN] CAN_Handler CAN_RAM_MOVE_DONE_INT_FLAG");
 *      CAN_ClearINTPendingBit(CAN0, CAN_RAM_MOVE_DONE_INT_FLAG);
 *     }
 * }
 * \endcode
 */
void CAN_ClearINTPendingBit(CAN_TypeDef *CANx, uint32_t CAN_INT_FLAG);
/**
 * \brief  Gets the specified CAN error status.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  CAN_ERR_STAT: the specified CAN error.
 *     This parameter can be one of the following values:
 *     \arg CAN_ERROR_RX: This bit is set to 1 when an error occurred during the receiving process.
 *     \arg CAN_ERROR_TX: This bit is set to 1 when an error occurred during the sending process.
 *     \arg CAN_ERROR_ACK: This bit is set to 1 when the latest error is ack error.
 *     \arg CAN_ERROR_STUFF: This bit is set to 1 when the latest error is stuff error.
 *     \arg CAN_ERROR_CRC: This bit is set to 1 when the latest error is crc error.
 *     \arg CAN_ERROR_FORM: This bit is set to 1 when the latest error is form error.
 *     \arg CAN_ERROR_BIT1: This bit is set to 1 when the latest error is bit error, tx=1 but rx=0.
 *     \arg CAN_ERROR_BIT0: This bit is set to 1 when the latest error is bit error, tx=0 but rx=1.
 * \return The new state of CAN_INT (SET or RESET).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void CAN_Handler(void)
 * {
 *     if (SET == CAN_GetErrorStatus(CAN0, CAN_ERROR_TX))
 *     {
 *          DBG_DIRECT("[CAN] CAN_ERROR_TX");
 *          CAN_CLearErrorStatus(CAN0, CAN_ERROR_TX);
 *     }
 * }
 * \endcode
 */
FlagStatus CAN_GetErrorStatus(CAN_TypeDef *CANx, uint32_t CAN_ERR_STAT);
/**
 * \brief  Clears the specified CAN error status.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  CAN_ERR_STAT: the specified CAN error.
 *     This parameter can be one of the following values:
 *     \arg CAN_ERROR_RX: This bit is set to 1 when an error occurred during the receiving process.
 *     \arg CAN_ERROR_TX: This bit is set to 1 when an error occurred during the sending process.
 *     \arg CAN_ERROR_ACK: This bit is set to 1 when the latest error is ack error.
 *     \arg CAN_ERROR_STUFF: This bit is set to 1 when the latest error is stuff error.
 *     \arg CAN_ERROR_CRC: This bit is set to 1 when the latest error is crc error.
 *     \arg CAN_ERROR_FORM: This bit is set to 1 when the latest error is form error.
 *     \arg CAN_ERROR_BIT1: This bit is set to 1 when the latest error is bit error, tx=1 but rx=0.
 *     \arg CAN_ERROR_BIT0: This bit is set to 1 when the latest error is bit error, tx=0 but rx=1.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * void CAN_Handler(void)
 * {
 *     if (SET == CAN_GetErrorStatus(CAN0, CAN_ERROR_TX))
 *     {
 *          DBG_DIRECT("[CAN] CAN_ERROR_TX");
 *          CAN_CLearErrorStatus(CAN0, CAN_ERROR_TX);
 *     }
 * }
 * \endcode
 */
void CAN_CLearErrorStatus(CAN_TypeDef *CANx, uint32_t CAN_ERR_STAT);
/**
 * \brief  Sets the CAN message buffer Tx mode.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  p_tx_frame_params: the CAN frame parameter.
 * \param[in]  p_frame_data: the specified CAN data.
 * \param[in]  data_len: the length of CAN data to be sent.
 * \return the state of set buffer @ref CANError_TypeDef.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_basic_tx(uint32_t buf_id, CANDataFrameSel_TypeDef frame_type, \
 *                        uint16_t frame_id, uint32_t ext_id, uint8_t *tx_data, uint8_t data_len)
 * {
 *
 *   CANError_TypeDef tx_error;
 *
 *   CANTxFrame_TypeDef tx_frame_type;
 *
 *   tx_frame_type.msg_buf_id = buf_id;
 *   tx_frame_type.frame_type = frame_type;
 *   tx_frame_type.standard_frame_id = frame_id;
 *   tx_frame_type.frame_brs_bit = CAN_BRS_NO_SWITCH_BIT_TIMING;
 *   tx_frame_type.auto_reply_bit = DISABLE;
 *   tx_frame_type.extend_frame_id = 0;
 *
 *   switch (frame_type)
 *   {
 *   case CAN_EXT_DATA_FRAME:
 *   case CAN_EXT_REMOTE_FRAME:
 *       tx_frame_type.extend_frame_id = ext_id;
 *   case CAN_STD_DATA_FRAME:
 *   case CAN_STD_REMOTE_FRAME:
 *       break;
 *   case CAN_FD_EXT_DATA_FRAME:
 *       tx_frame_type.extend_frame_id = ext_id;
 *   case CAN_FD_STD_DATA_FRAME:
 *       tx_frame_type.frame_brs_bit = CAN_BRS_SWITCH_BIT_TIMING;
 *       break;
 *   }
 *
 *   CAN_MBTxINTConfig(CAN0, tx_frame_type.msg_buf_id, ENABLE);
 *   tx_error = CAN_SetMsgBufTxMode(CAN0, &tx_frame_type, tx_data, data_len);
 *
 *   while (CAN_GetRamState(CAN0) != CAN_RAM_STATE_IDLE);
 *
 *   if (tx_error != CAN_NO_ERR)
 *   {
 *       IO_PRINT_INFO1("can_basic_tx: tx error %d", tx_error);
 *   }
 *  }
 * \endcode
 */
CANError_TypeDef CAN_SetMsgBufTxMode(CAN_TypeDef *CANx, CANTxFrame_TypeDef *p_tx_frame_params,
                                     uint8_t *p_frame_data,
                                     uint8_t data_len);
/**
 * \brief  Sets the CAN message buffer Rx mode.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  p_rx_frame_params: the CAN frame parameter.
 * \return the state of set buffer @ref CANError_TypeDef.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_basic_rx(void)
 * {
 *     CANError_TypeDef rx_error;
 *     CANRxFrame_TypeDef rx_frame_type;
 *     rx_frame_type.msg_buf_id = 7;
 *
 *     rx_frame_type.extend_frame_id = 0;
 *     rx_frame_type.standard_frame_id = 0;
 *     rx_frame_type.frame_rtr_mask = CAN_RX_FRAME_MASK_RTR;
 *     rx_frame_type.frame_ide_mask = CAN_RX_FRAME_MASK_IDE;
 *     rx_frame_type.frame_id_mask = CAN_RX_FRAME_MASK_ID;
 *     rx_frame_type.rx_dma_en = RESET;
 *     rx_frame_type.auto_reply_bit = RESET;
 *     rx_error = CAN_SetMsgBufRxMode(CAN0, &rx_frame_type);
 *
 *     CAN_MBRxINTConfig(CAN0, rx_frame_type.msg_buf_id, ENABLE);
 *
 *     while (CAN_GetRamState(CAN0) != CAN_RAM_STATE_IDLE);
 *
 *     if (rx_error != CAN_NO_ERR)
 *     {
 *         IO_PRINT_INFO1("can_basic_rx: rx error %d", rx_error);
 *     }
 *
 *     IO_PRINT_INFO0("can_basic_rx: waiting for rx...");
 * }
 * \endcode
 */
CANError_TypeDef CAN_SetMsgBufRxMode(CAN_TypeDef *CANx, CANRxFrame_TypeDef *p_rx_frame_params);
/**
 * \brief  Gets message buffer information.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  msg_buf_id: message buffer id.
 * \param[out] p_mb_info: message buffer information.
 * \return the state of get buffer information @ref CANError_TypeDef.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_msg_info(void)
 * {
 *     uint8_t index = 0
 *     uint8_t rx_data[64];
 *     CANMsgBufInfo_TypeDef mb_info;
 *     CAN_GetMsgBufInfo(CAN0, index, &mb_info);
 *     CAN_GetRamData(CAN0, mb_info.data_length, rx_data);
 * }
 * \endcode
 */
CANError_TypeDef CAN_GetMsgBufInfo(CAN_TypeDef *CANx, uint8_t msg_buf_id,
                                   CANMsgBufInfo_TypeDef *p_mb_info);
/**
 * \brief  Gets the RAM data of message buffer.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  data_len: the length of RAM data.
 * \param[out] p_data: data buffer to be received.
 * \return the state of get RAM data @ref CANError_TypeDef.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_ram_data(void)
 * {
 *     uint8_t index = 0
 *     uint8_t rx_data[64];
 *     CANMsgBufInfo_TypeDef mb_info;
 *     CAN_GetMsgBufInfo(CAN0, index, &mb_info);
 *     CAN_GetRamData(CAN0, mb_info.data_length, rx_data);
 * }
 * \endcode
 */
CANError_TypeDef CAN_GetRamData(CAN_TypeDef *CANx, uint8_t data_len, uint8_t *p_data);
/**
 * \brief  Check the type of frame.
 * \param[in]  rtr_bit.
 * \param[in]  ide_bit.
 * \param[in]  edl_bit.
 * \return the type of frame @ref CANDataFrameSel_TypeDef.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_ram_data(void)
 * {
 *     uint8_t index = 0
 *     uint8_t rx_data[64];
 *     CANMsgBufInfo_TypeDef mb_info;
 *     CAN_GetMsgBufInfo(CAN0, index, &mb_info);
 *     CANDataFrameSel_TypeDef frame_type = CAN_CheckFrameType(mb_info.rtr_bit, mb_info.ide_bit,
 *                                                                              mb_info.edl_bit);
 * }
 * \endcode
 */
CANDataFrameSel_TypeDef CAN_CheckFrameType(uint8_t rtr_bit, uint8_t ide_bit, uint8_t edl_bit);
/**
 * \brief  Config message buffer tx interrupt.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \param[in]  newState: the tx state of message buffer.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_basic_tx(uint32_t buf_id, CANDataFrameSel_TypeDef frame_type, \
 *                        uint16_t frame_id, uint32_t ext_id, uint8_t *tx_data, uint8_t data_len)
 * {
 *
 *   CANError_TypeDef tx_error;
 *
 *   CANTxFrame_TypeDef tx_frame_type;
 *
 *   tx_frame_type.msg_buf_id = buf_id;
 *   tx_frame_type.frame_type = frame_type;
 *   tx_frame_type.standard_frame_id = frame_id;
 *   tx_frame_type.frame_brs_bit = CAN_BRS_NO_SWITCH_BIT_TIMING;
 *   tx_frame_type.auto_reply_bit = DISABLE;
 *   tx_frame_type.extend_frame_id = 0;
 *
 *   switch (frame_type)
 *   {
 *   case CAN_EXT_DATA_FRAME:
 *   case CAN_EXT_REMOTE_FRAME:
 *       tx_frame_type.extend_frame_id = ext_id;
 *   case CAN_STD_DATA_FRAME:
 *   case CAN_STD_REMOTE_FRAME:
 *       break;
 *   case CAN_FD_EXT_DATA_FRAME:
 *       tx_frame_type.extend_frame_id = ext_id;
 *   case CAN_FD_STD_DATA_FRAME:
 *       tx_frame_type.frame_brs_bit = CAN_BRS_SWITCH_BIT_TIMING;
 *       break;
 *   }
 *
 *   CAN_MBTxINTConfig(CAN0, tx_frame_type.msg_buf_id, ENABLE);
 *   tx_error = CAN_SetMsgBufTxMode(CAN0, &tx_frame_type, tx_data, data_len);
 *
 *   while (CAN_GetRamState(CAN0) != CAN_RAM_STATE_IDLE);
 *
 *   if (tx_error != CAN_NO_ERR)
 *   {
 *       IO_PRINT_INFO1("can_basic_tx: tx error %d", tx_error);
 *   }
 *  }
 * \endcode
 */
void CAN_MBTxINTConfig(CAN_TypeDef *CANx, uint8_t message_buffer_index, FunctionalState newState);
/**
 * \brief  Config message buffer rx interrupt.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \param[in]  newState: the rx state of message buffer.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_basic_rx(void)
 * {
 *     CANError_TypeDef rx_error;
 *     CANRxFrame_TypeDef rx_frame_type;
 *     rx_frame_type.msg_buf_id = 7;
 *
 *     rx_frame_type.extend_frame_id = 0;
 *     rx_frame_type.standard_frame_id = 0;
 *     rx_frame_type.frame_rtr_mask = CAN_RX_FRAME_MASK_RTR;
 *     rx_frame_type.frame_ide_mask = CAN_RX_FRAME_MASK_IDE;
 *     rx_frame_type.frame_id_mask = CAN_RX_FRAME_MASK_ID;
 *     rx_frame_type.rx_dma_en = RESET;
 *     rx_frame_type.auto_reply_bit = RESET;
 *     rx_error = CAN_SetMsgBufRxMode(CAN0, &rx_frame_type);
 *
 *     CAN_MBRxINTConfig(CAN0, rx_frame_type.msg_buf_id, ENABLE);
 *
 *     while (CAN_GetRamState(CAN0) != CAN_RAM_STATE_IDLE);
 *
 *     if (rx_error != CAN_NO_ERR)
 *     {
 *         IO_PRINT_INFO1("can_basic_rx: rx error %d", rx_error);
 *     }
 *
 *     IO_PRINT_INFO0("can_basic_rx: waiting for rx...");
 * }
 * \endcode
 */
void CAN_MBRxINTConfig(CAN_TypeDef *CANx, uint8_t message_buffer_index, FunctionalState newState);
/**
 * \brief  Gets CAN FIFO status.
 * \param[in] CANx: selected CAN peripheral.
 * \param[out]  CAN_FifoStatus: the status of CAN FIFO.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_fifo_status(void)
 * {
 *     CANFifoStatus_TypeDef fifo_status;
 *     CAN_GetFifoStatus(CAN0, &fifo_status);
 * }
 * \endcode
 */
void CAN_GetFifoStatus(CAN_TypeDef *CANx, CANFifoStatus_TypeDef *CAN_FifoStatus);
/**
 * \brief  Sets tx message trigger by timestamp timer.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  newState: the state of tx trigger.
 * \param[in]  trigger_timestamp_begin: end of trigger time.
 * \param[in]  close_offset: start of trigger time.
 * \return None.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_tx_trigger(void)
 * {
 *     uint16_t begin_ts = CAN_GetTimeStampCount(CAN0);
 *     begin_ts += 1000;
 *     CAN_TxTriggerConfig(CAN0, ENABLE, begin_ts, 100);
 * }
 * \endcode
 */
void CAN_TxTriggerConfig(CAN_TypeDef *CANx, FunctionalState newState,
                         uint16_t trigger_timestamp_begin,
                         uint16_t close_offset);
/**
 * \brief  Get can bus state.
 * \param[in] CANx: selected CAN peripheral.
 * \return The state of bus(CAN_BUS_STATE_ON or CAN_BUS_STATE_OFF).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_bus_state(void)
 * {
 *     while (CAN_GetBusState(CAN0) != CAN_BUS_STATE_ON);
 * }
 * \endcode
 */
uint32_t CAN_GetBusState(CAN_TypeDef *CANx);
/**
 * \brief  Get message buffer ram state.
 * \param[in] CANx: selected CAN peripheral.
 * \return The state of message buffer ram(CAN_RAM_STATE_EXCHANGING or CAN_RAM_STATE_IDLE).
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_ram_state(void)
 * {
 *     while (CAN_GetRamState(CAN0) != CAN_RAM_STATE_IDLE);
 * }
 * \endcode
 */
uint32_t CAN_GetRamState(CAN_TypeDef *CANx);
/**
 * \brief  Get message buffer tx done flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer tx done.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_tx_done_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnTxDoneFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_trx_handler: MB_%d tx done", index);
 *              CAN_ClearMBnTxDoneFlag(CAN0, index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnTxDoneFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Clear message buffer tx done flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_tx_done_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnTxDoneFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_trx_handler: MB_%d tx done", index);
 *              CAN_ClearMBnTxDoneFlag(CAN0, index);
 *          }
 *      }
 * }
 * \endcode
 */
void CAN_ClearMBnTxDoneFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Get message buffer tx error flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer tx error.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_tx_error_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnTxErrorFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_trx_handler: CAN ERROR TX MB_%d", index);
 *              CAN_ClearMBnTxErrorFlag(CAN0, index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnTxErrorFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Clear message buffer tx error flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_tx_error_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnTxErrorFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_trx_handler: CAN ERROR TX MB_%d", index);
 *              CAN_ClearMBnTxErrorFlag(CAN0, index);
 *          }
 *      }
 * }
 * \endcode
 */
void CAN_ClearMBnTxErrorFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Get message buffer tx finish flag, it indicates the tx message in the message buffer finish sending.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer tx finish.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_tx_finish_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnStatusTxFinishFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_get_tx_finish_flag: TX finish MB_%d", index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnStatusTxFinishFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Get message buffer tx request flag, it indicates the tx message in buffer is pending for transmit.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer tx request.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_tx_req_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnStatusTxReqFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_get_tx_req_flag: TX pending MB_%d", index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnStatusTxReqFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Get message buffer rx done flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer rx done.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_rx_done_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnRxDoneFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_trx_handler: MB_%d rx done", index);
 *              CAN_ClearMBnRxDoneFlag(CAN0, index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnRxDoneFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Clear message buffer rx done flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_clear_rx_done_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnRxDoneFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_trx_handler: MB_%d rx done", index);
 *              CAN_ClearMBnRxDoneFlag(CAN0, index);
 *          }
 *      }
 * }
 * \endcode
 */
void CAN_ClearMBnRxDoneFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Get message buffer rx valid flag, it indicates new message has been received in the message buffer.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer rx valid.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_rx_valid_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnStatusRxValidFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_get_rx_valid_flag: MB_%d rx valid", index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnStatusRxValidFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Get message buffer rx ready flag, it indicates the message buffer is ready for receiving a new message.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer rx ready.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_rx_ready_flag(void)
 * {
 *     for (uint8_t index = 0; index < CAN_MESSAGE_BUFFER_MAX_CNT; index++)
 *     {
 *          if (SET == CAN_GetMBnStatusRxReadyFlag(CAN0, index))
 *          {
 *              IO_PRINT_INFO1("can_get_rx_ready_flag: MB_%d rx ready", index);
 *          }
 *      }
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnStatusRxReadyFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Enable or disable can time stamp.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  newState: New state of the time stamp.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_enable_timestamp(void)
 * {
 *     CAN_TimeStampConfig(CAN0, ENABLE);
 * }
 * \endcode
 */
void CAN_TimeStampConfig(CAN_TypeDef *CANx, FunctionalState newState);
/**
 * \brief  Get time stamp count.
