wolaite2024/jlab-jh5003-earphone/inc/rtl87x3eu/io/rtl_can.h
 * \param[in] CANx: selected CAN peripheral.
 * \return Time stamp count.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_timestamp(void)
 * {
 *     uint16_t begin_ts = CAN_GetTimeStampCount(CAN0);
 * }
 * \endcode
 */
uint16_t CAN_GetTimeStampCount(CAN_TypeDef *CANx);
/**
 * \brief  Get rx dma block size(word).
 * \param[in] CANx: selected CAN peripheral.
 * \return Rx dma block size.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_dma_msize(void)
 * {
 *     uint32_t dma_buffer_size = CAN_GetRxDmaMsize(CAN0);
 * }
 * \endcode
 */
uint32_t CAN_GetRxDmaMsize(CAN_TypeDef *CANx);
/**
 * \brief  Get message buffer rx dma enable flag.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \return The flag of message buffer rx dma enable.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_get_rx_dma_enable_flag(void)
 * {
 *     FlagStatus dma_en_flag = CAN_GetMBnRxDmaEnFlag(CAN0, index);
 * }
 * \endcode
 */
FlagStatus CAN_GetMBnRxDmaEnFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index);
/**
 * \brief  Set message buffer rx dma enable.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  message_buffer_index: CAN message buffer index.
 * \param[in]  newState: New state of the message buffer rx dma enable.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_set_rx_dma_enable(void)
 * {
 *     CAN_SetMBnRxDmaEnFlag(CAN0, RX_DMA_BUF_ID, ENABLE);
 * }
 * \endcode
 */
void CAN_SetMBnRxDmaEnFlag(CAN_TypeDef *CANx, uint8_t message_buffer_index,
                           FunctionalState newState);

/**
 * \brief  Config CAN clock source div.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in]  div: CAN clock div @ref CANClkDIV_TypeDef.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_config_clock(void)
 * {
 *     CAN_ClkDivConfig(CAN0, CAN_CLK_DIV_1);
 * }
 * \endcode
 */
void CAN_ClkDivConfig(CAN_TypeDef *CANx, CANClkDIV_TypeDef div);

#if (CAN_SUPPORT_SLEEP_MODE == 1)
/**
 * \brief  Check CAN sleep state.
 * \param[in] CANx: selected CAN peripheral.
 * \return The flag of CAN sleep state.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_check_sleep_status(void)
 * {
 *     FlagStatus status = CAN_CheckSleepStatus(CAN0);
 * }
 * \endcode
 */
FlagStatus CAN_CheckSleepStatus(CAN_TypeDef *CANx);

/**
 * \brief  Enable or disable CAN lower power clock.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] newState: Enable or disable CAN lower power clock.
 * \param[in] div: Low power clock div @ref CANLowPowerClkDIV_TypeDef.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_enable_lower_power_clk(void)
 * {
 *     CAN_LowPowerClkCmd(CAN0, ENABLE, CAN_LOW_CLK_DIV_5);
 *     CAN_SetWakeUpPinFltFunction(CAN0, ENABLE, 10);
 *     CAN_RequestToSleepMode(CAN0);
 * }
 * \endcode
 */
void CAN_LowPowerClkCmd(CAN_TypeDef *CANx, FunctionalState newState, CANLowPowerClkDIV_TypeDef div);

/**
 * \brief  Config wake up pin fit function.
 * \param[in] CANx: selected CAN peripheral.
 * \param[in] newState: Enable or disable CAN wake up pin fit function.
 * \param[in] flt_length: Config wake up pin fit length.
 *                        minimu value is 1. The unit is low power clock period.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_config_wake_up_pin(void)
 * {
 *     CAN_LowPowerClkCmd(CAN0, ENABLE, CAN_LOW_CLK_DIV_5);
 *     CAN_SetWakeUpPinFltFunction(CAN0, ENABLE, 10);
 *     CAN_RequestToSleepMode(CAN0);
 * }
 * \endcode
 */
void CAN_SetWakeUpPinFltFunction(CAN_TypeDef *CANx, FunctionalState newState, uint8_t flt_length);
/**
 * \brief  Request CAN to sleep mode.
 * \param[in] CANx: selected CAN peripheral.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_request_sleep(void)
 * {
 *     CAN_LowPowerClkCmd(CAN0, ENABLE, CAN_LOW_CLK_DIV_5);
 *     CAN_SetWakeUpPinFltFunction(CAN0, ENABLE, 10);
 *     CAN_RequestToSleepMode(CAN0);
 * }
 * \endcode
 */
void CAN_RequestToSleepMode(CAN_TypeDef *CANx);

/**
 * \brief  Manual wake up CAN.
 * \param[in] CANx: selected CAN peripheral.
 * \return none.
 *
 * <b>Example usage</b>
 * \code{.c}
 *
 * static void can_manual_wake_up(void)
 * {
 *     CAN_ManualWakeup(CAN0);
 * }
 * \endcode
 */
void CAN_ManualWakeup(CAN_TypeDef *CANx);
#endif

/** End of 87x3eultra_CAN_Exported_Functions
  * \}
  */

/** @} */ /* End of group 87x3eultra_CAN */

#ifdef __cplusplus
}
#endif

#endif /* _RTL_CAN_H_ */
/******************* (C) COPYRIGHT 2024 Realtek Semiconductor *****END OF FILE****/
